/**
 * *****************************************************************************
 * @file     bsp_nvic.c
 * @brief
 * @author   sinowealth
 * @version  1.0
 * @date     2024-08-07
 *
 * *****************************************************************************
 */

/* Includes ------------------------------------------------------------------*/

#include "sh30f9010.h"


/**
 * 1. 要包含头文件：core_cm0plus.h
 * 2. m0+的中断优先级共4级：0最高，3最低。
 *
 */


/**
 * @brief
 *
 */
void    bsp_nvic_init(void)
{
#if 0
    /* 本例1：将所有的中断都设置为最低优先级：3 */
    IRQn_Type i;

    for (i=SysTick_IRQn; i<=TIM3_FIFO2_IRQn; i++)
    {
        NVIC_SetPriority((IRQn_Type)i, 3);
    }
#endif

#if 0
    /* 本例2：将TIM2设置为最高优先级 */
    NVIC_SetPriority(TIM2_FIFO1_IRQn, 0);     // 0~3 共4个优先
#endif
}

/*----------------------------------------- E.N.D -----------------------------------------*/
