#ifndef	USER_DCFANTABLE_H
#define	USER_DCFANTABLE_H

static	const	ST_FANRAW_T	astFanRawData_13_12T_YX[] =
{//13Z8L2-W  PL锟斤拷锟斤拷压164锟斤拷PH锟斤拷锟斤拷压1260 FH锟斤拷锟斤拷值50  FL锟斤拷锟斤拷值29
	//U		,spd
	/*
	{0x20,1806},
	{0x27,1983},
	{0x2F,2169},
	{0x37,2332},
	{0x3F,2486},
	{0x47,2620},
	{0x4F,2752},
	{0x57,2870},
	{0x5F,2986},
	{0x67,3099},
	{0xFF,9999}*/
	{0x20,9999},
	{0x27,9999},
	{0x2F,9999},
	{0x37,9999},
	{0x3F,9999},
	{0x47,9999},
	{0x4F,9999},
	{0x57,9999},
	{0x5F,9999},
	{0x67,9999},
	{0xFF,9999}
};
static	const	ST_FANRAW_T	astFanRawData_13_12T_XC[] =
{
	//U		,spd
	/*
	{0x1D,1687},
	{0x2A,2008},
	{0x37,2273},
	{0x44,2501},
	{0x51,2694},
	{0x5E,2873},
	{0x6B,3040},
	{0x78,3191},
	{0x85,3332},
	{0x93,3465},
	{0xFF,9999}*/
	{0x1D,1687},
	{0x2A,9999},
	{0x37,9999},
	{0x44,9999},
	{0x51,9999},
	{0x5E,9999},
	{0x6B,9999},
	{0x78,9999},
	{0x85,9999},
	{0x93,9999},
	{0xFF,9999}
};
static	const	ST_FANRAW_T	astFanRawData_16_12T_YX[] =
{//16Z7CN2-W  PL锟斤拷锟斤拷压135锟斤拷PH锟斤拷锟斤拷压1230 FH锟斤拷锟斤拷值52  FL锟斤拷锟斤拷值50
	//U		,spd
	// {0x19,1535},
	// {0x23,1819},
	// {0x2D,2064},
	// {0x37,2261},
	// {0x41,2434},  
	// {0x4C,2615},
	// {0x56,2758},
	// {0x60,2887},
	// {0x6A,3019},
	// {0x75,3146},
	// {0xFF,9999}
	{0x18,1599},
	{0x22,1853},
	{0x2D,2113},
	{0x37,2307},
	{0x42,2499},
	{0x4C,2654},
	{0x57,2810},
	{0x61,2939},
	{0x6C,3070},
	{0x77,3192},
	{0x81,3293},
	{0xFF,9999}
};

static	const	ST_FANRAW_T	astFanRawData_16_12T_XC[] =
{//16Z7CN2-W  PL锟斤拷锟斤拷压135锟斤拷PH锟斤拷锟斤拷压1230 FH锟斤拷锟斤拷值52  FL锟斤拷锟斤拷值50
	//U		,spd
	{0x18,1549},
	{0x21,1828},
	{0x2B,2083},
	{0x35,2302},
	{0x3E,2470},
	{0x48,2646},
	{0x52,2795},
	{0x5B,2922},
	{0x65,3057},
	{0x6F,3174},
	{0xFF,9999}
};
static	const	ST_FANRAW_T	astFanRawData_18_12T_YX[] =
{//18Z8L2-W  PL锟斤拷锟斤拷压175锟斤拷PH锟斤拷锟斤拷压1180 FH锟斤拷锟斤拷值63  FL锟斤拷锟斤拷值28
	//U		,spd
	{0x1D,1706},
	{0x2E,2131},
	{0x3F,2450},
	{0x50,2710},
	{0x61,2941},
	{0x72,3146},
	{0x83,3333},
	{0x94,3488},
	{0xA5,3658},
	{0xB6,3781},
	{0xFF,9999}

};

static	const	ST_FANRAW_T	astFanRawData_18_12T_XC[] =
{//18Z8L2-W  PL锟斤拷锟斤拷压175锟斤拷PH锟斤拷锟斤拷压1180 FH锟斤拷锟斤拷值63  FL锟斤拷锟斤拷值28
	//U		,spd
	{0x19,1642},
	{0x28,2080},
	{0x38,2419},
	{0x48,2698},
	{0x58,2941},
	{0x68,3146},
	{0x78,3355},
	{0x88,3515},
	{0x98,3688},
	{0xA8,3835},
	{0xB7,3947},
	{0xFF,9999}
	// {0x1C,1727},
	// {0x2B,2126},
	// {0x3B,2454},
	// {0x4A,2706},
	// {0x5A,2941},
	// {0x69,3129},
	// {0x79,3320},
	// {0x88,3484},
	// {0x98,3634},
	// {0xA8,3777},
	// {0xFF,9999}

};
#endif
